rmre-rails-models-reverse-engineering-gem/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-06-10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>RMRE - rails models reverse engineering gem</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="../pdn.css" type="text/css"/>
<link rel='stylesheet' href='https://use.fontawesome.com/releases/v5.8.2/css/all.css' integrity='sha384-oS3vJWv+0UjzBfQzYUhtDYW+Pj2yciDJxpsK1OYPAYjqT085Qq/1cq5FLXAZQ7Ay' crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">
<div class='cover'>
<div class='cover-card'>
<div class='author-name'>Boško Ivanišević</div>
<div class='author-job'>Developer, Theoretical Physicist</div>
<div class='author-bio mbm'>Ruby, JavaScript, Elixir, C++ and few more</div>
<nav id='sidenav' clas='nav'>
<ul class='nav-list'>
<li class='nav-item'><a href='../index.html'>Home</a1> <span>/</span></li>
<li class='nav-item'><a href='../about.html'>About</a> <span>/</span></li>
</ul>
</nav>
<div class='social-links'>
<ul>
<li><a href='https://twitter.com/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-twitter'></i>
</a></li>
<li><a href='https://linkedin.com/in/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-linkedin'></i>
</a></li>
<li><a href='https://github.com/bosko' class='social-link-item' target='_blank'>
<i class='fab fa-github'></i>
</a></li>
<li><a href='https://stackoverflow.com/users/1665470/boško-ivanišević' class='social-link-item' target='_blank'>
<i class='fab fa-stack-overflow'></i>
</a></li>
<li><a href='https://dev.to/bosko' class='social-link-item' target='_blank'>
  <i class='fab fa-dev' title='bosko's DEV Profile'></i>
</a></li>
</ul>
</div>
</div>
</div>
</div>
<main id="content">
<header>
<h1 class="title">RMRE - rails models reverse engineering gem</h1>
<p class="subtitle">2010-09-30</p>
</header><p>
Very often I have to work on databases which do not follow
ActiveRecord convention and making ActiveRecord models, if number of
tables is large, is very slow and boring task. In order to speed up
and simplify it I’ve created <a href="http://github.com/bosko/rmre">Rmre gem</a>. Gem is quite simple yet you
might find it useful if you want to create fixtures, migrations or
simply port application to Ruby on Rails.
</p>

<p>
So how it works? For each table in the database, gem creates
model. Name of the model is created using Rails `classify`
method. Moreover, if table’s primary key is not column named “id” gem
sets primary key by adding `set<sub>primary</sub><sub>key</sub> &ldquo;primaryKeyColumnName&rdquo;`
line to the model. In addition for MySQL, PostgreSQL, Oracle or MS SQL
foreign keys are analyzed and for each constraint gem generates
`belongs<sub>to</sub>` or `has<sub>many</sub>` lines. Here is model created for table
<b>store</b> in <a href="http://dev.mysql.com/doc/sakila/en/sakila.html">Sakila</a> MySQL test database:
</p>

<div class="org-src-container">
<pre class="src src-ruby">class Store &lt; ActiveRecord::Base
  set_primary_key :store_id
  set_table_name 'store'
  has_many :customers, :class_name =&gt; 'Customer'
  has_many :inventories, :class_name =&gt; 'Inventory'
  has_many :staffs, :class_name =&gt; 'Staff'
  belongs_to :address, :class_name =&gt; 'Addres', :foreign_key =&gt; :address_id
  belongs_to :staff, :class_name =&gt; 'Staff', :foreign_key =&gt; :manager_staff_id
end
</pre>
</div>
</main>
</body>
</html>
